IOsonata/IOsonata/RISCV/Espressif/include/esp32p4.h
#define ESP32_HPCPUTCP_BASE                     ESP32P4_HPCPUTCP_BASE
#define ESP32_HPPERIPH0_BASE                    ESP32P4_HPPERIPH0_BASE
#define ESP32_HPPERIPH1_BASE                    ESP32P4_HPPERIPH1_BASE
#define ESP32_LPAON_BASE                        ESP32P4_LPAON_BASE
#define ESP32_LPPERIPH_BASE                     ESP32P4_LPPERIPH_BASE
#define ESP32_TRACE0_BASE                       ESP32P4_TRACE0_BASE
#define ESP32_TRACE1_BASE                       ESP32P4_TRACE1_BASE
#define ESP32_TRACE_BASE                        ESP32P4_TRACE_BASE
#define ESP32_CPU_BUS_MON_BASE                  ESP32P4_CPU_BUS_MON_BASE
#define ESP32_L2MEM_MON_BASE                    ESP32P4_L2MEM_MON_BASE
#define ESP32_TCM_MON_BASE                      ESP32P4_TCM_MON_BASE
#define ESP32_CACHE_BASE                        ESP32P4_CACHE_BASE
#define ESP32_USB2_BASE                         ESP32P4_USB2_BASE
#define ESP32_USB11_BASE                        ESP32P4_USB11_BASE
#define ESP32_USB_OTG_BASE                      ESP32P4_USB_OTG_BASE
#define ESP32_USB_WRAP_BASE                     ESP32P4_USB_WRAP_BASE
#define ESP32_GDMA_BASE                         ESP32P4_GDMA_BASE
#define ESP32_REGDMA_BASE                       ESP32P4_REGDMA_BASE
#define ESP32_SDMMC_BASE                        ESP32P4_SDMMC_BASE
#define ESP32_H264_CORE_BASE                    ESP32P4_H264_CORE_BASE
#define ESP32_AHB_DMA_BASE                      ESP32P4_AHB_DMA_BASE
#define ESP32_JPEG_BASE                         ESP32P4_JPEG_BASE
#define ESP32_PPA_BASE                          ESP32P4_PPA_BASE
#define ESP32_DMA2D_BASE                        ESP32P4_DMA2D_BASE
#define ESP32_KEYMNG_BASE                       ESP32P4_KEYMNG_BASE
#define ESP32_AXI_DMA_BASE                      ESP32P4_AXI_DMA_BASE
#define ESP32_FLASH_SPI0_BASE                   ESP32P4_FLASH_SPI0_BASE
#define ESP32_SPIMEM0_BASE                      ESP32P4_SPIMEM0_BASE
#define ESP32_FLASH_SPI1_BASE                   ESP32P4_FLASH_SPI1_BASE
#define ESP32_SPIMEM1_BASE                      ESP32P4_SPIMEM1_BASE
#define ESP32_PSRAM_MSPI0_BASE                  ESP32P4_PSRAM_MSPI0_BASE
#define ESP32_PSRAM_MSPI1_BASE                  ESP32P4_PSRAM_MSPI1_BASE
#define ESP32_CRYPTO_BASE                       ESP32P4_CRYPTO_BASE
#define ESP32_EMAC_BASE                         ESP32P4_EMAC_BASE
#define ESP32_USBPHY_BASE                       ESP32P4_USBPHY_BASE
#define ESP32_DDRPHY_BASE                       ESP32P4_DDRPHY_BASE
#define ESP32_PVT_BASE                          ESP32P4_PVT_BASE
#define ESP32_CSI_HOST_BASE                     ESP32P4_CSI_HOST_BASE
#define ESP32_CSI_BRG_BASE                      ESP32P4_CSI_BRG_BASE
#define ESP32_DSI_HOST_BASE                     ESP32P4_DSI_HOST_BASE
#define ESP32_DSI_BRG_BASE                      ESP32P4_DSI_BRG_BASE
#define ESP32_ISP_BASE                          ESP32P4_ISP_BASE
#define ESP32_RMT_BASE                          ESP32P4_RMT_BASE
#define ESP32_BITSCRAMBLER_BASE                 ESP32P4_BITSCRAMBLER_BASE
#define ESP32_AXI_ICM_BASE                      ESP32P4_AXI_ICM_BASE
#define ESP32_MCPWM0_BASE                       ESP32P4_MCPWM0_BASE
#define ESP32_MCPWM_BASE                        ESP32P4_MCPWM_BASE
#define ESP32_MCPWM1_BASE                       ESP32P4_MCPWM1_BASE
#define ESP32_TIMG0_BASE                        ESP32P4_TIMG0_BASE
#define ESP32_TIMG1_BASE                        ESP32P4_TIMG1_BASE
#define ESP32_I2C0_BASE                         ESP32P4_I2C0_BASE
#define ESP32_I2C_BASE                          ESP32P4_I2C_BASE
#define ESP32_I2C1_BASE                         ESP32P4_I2C1_BASE
#define ESP32_I2S0_BASE                         ESP32P4_I2S0_BASE
#define ESP32_I2S_BASE                          ESP32P4_I2S_BASE
#define ESP32_I2S1_BASE                         ESP32P4_I2S1_BASE
#define ESP32_I2S2_BASE                         ESP32P4_I2S2_BASE
#define ESP32_PCNT_BASE                         ESP32P4_PCNT_BASE
#define ESP32_UART0_BASE                        ESP32P4_UART0_BASE
#define ESP32_UART1_BASE                        ESP32P4_UART1_BASE
#define ESP32_UART2_BASE                        ESP32P4_UART2_BASE
#define ESP32_UART3_BASE                        ESP32P4_UART3_BASE
#define ESP32_UART4_BASE                        ESP32P4_UART4_BASE
#define ESP32_PARIO_BASE                        ESP32P4_PARIO_BASE
#define ESP32_PARL_IO_BASE                      ESP32P4_PARL_IO_BASE
#define ESP32_SPI2_BASE                         ESP32P4_SPI2_BASE
#define ESP32_GP_SPI2_BASE                      ESP32P4_GP_SPI2_BASE
#define ESP32_SPI3_BASE                         ESP32P4_SPI3_BASE
#define ESP32_GP_SPI3_BASE                      ESP32P4_GP_SPI3_BASE
#define ESP32_USB2JTAG_BASE                     ESP32P4_USB2JTAG_BASE
#define ESP32_USB_SERIAL_JTAG_BASE              ESP32P4_USB_SERIAL_JTAG_BASE
#define ESP32_LEDC_BASE                         ESP32P4_LEDC_BASE
#define ESP32_SOC_ETM_BASE                      ESP32P4_SOC_ETM_BASE
#define ESP32_INTR_BASE                         ESP32P4_INTR_BASE
#define ESP32_INTMTX_BASE                       ESP32P4_INTMTX_BASE
#define ESP32_TWAI0_BASE                        ESP32P4_TWAI0_BASE
#define ESP32_TWAI_BASE                         ESP32P4_TWAI_BASE
#define ESP32_TWAI1_BASE                        ESP32P4_TWAI1_BASE
#define ESP32_TWAI2_BASE                        ESP32P4_TWAI2_BASE
#define ESP32_I3C_MST_BASE                      ESP32P4_I3C_MST_BASE
#define ESP32_I3C_SLV_BASE                      ESP32P4_I3C_SLV_BASE
#define ESP32_LCDCAM_BASE                       ESP32P4_LCDCAM_BASE
#define ESP32_ADC_BASE                          ESP32P4_ADC_BASE
#define ESP32_SAR_ADC_BASE                      ESP32P4_SAR_ADC_BASE
#define ESP32_UHCI_BASE                         ESP32P4_UHCI_BASE
#define ESP32_GPIO_BASE                         ESP32P4_GPIO_BASE
#define ESP32_GPIO_EXT_BASE                     ESP32P4_GPIO_EXT_BASE
#define ESP32_IOMUX_BASE                        ESP32P4_IOMUX_BASE
#define ESP32_SYSTIMER_BASE                     ESP32P4_SYSTIMER_BASE
#define ESP32_HP_SYS_CLKRST_BASE                ESP32P4_HP_SYS_CLKRST_BASE
#define ESP32_PMU_BASE                          ESP32P4_PMU_BASE
#define ESP32_LP_CLKRST_BASE                    ESP32P4_LP_CLKRST_BASE
#define ESP32_EFUSE_BASE                        ESP32P4_EFUSE_BASE
#define ESP32_LP_TIMER_BASE                     ESP32P4_LP_TIMER_BASE
#define ESP32_RTC_TIMER_BASE                    ESP32P4_RTC_TIMER_BASE
#define ESP32_LP_AON_BASE                       ESP32P4_LP_AON_BASE
#define ESP32_LP_WDT_BASE                       ESP32P4_LP_WDT_BASE
#define ESP32_RTC_WDT_BASE                      ESP32P4_RTC_WDT_BASE
#define ESP32_LP_IOMUX_BASE                     ESP32P4_LP_IOMUX_BASE
#define ESP32_LP_GPIO_BASE                      ESP32P4_LP_GPIO_BASE
#define ESP32_LP_UART_BASE                      ESP32P4_LP_UART_BASE
#define ESP32_LP_I2C_BASE                       ESP32P4_LP_I2C_BASE
#define ESP32_LP_I2S_BASE                       ESP32P4_LP_I2S_BASE
#define ESP32_LPPERI_BASE                       ESP32P4_LPPERI_BASE
#define ESP32_INTPRI_BASE                       ESP32P4_INTPRI_BASE
#define ESP32_CLINT_M_BASE                      ESP32P4_CLINT_M_BASE
#define ESP32_CPU_CORE_COUNT                    ESP32P4_CPU_CORE_COUNT
#define ESP32_CPU_INTERRUPT_COUNT               ESP32P4_CPU_INTERRUPT_COUNT
#define ESP32_UART_COUNT                        ESP32P4_UART_COUNT
#define ESP32_HP_UART_COUNT                     ESP32P4_HP_UART_COUNT
#define ESP32_LP_UART_COUNT                     ESP32P4_LP_UART_COUNT
#define ESP32_SPI_MEM_COUNT                     ESP32P4_SPI_MEM_COUNT
#define ESP32_GP_SPI_COUNT                      ESP32P4_GP_SPI_COUNT
#define ESP32_I2C_COUNT                         ESP32P4_I2C_COUNT
#define ESP32_HP_I2C_COUNT                      ESP32P4_HP_I2C_COUNT
#define ESP32_LP_I2C_COUNT                      ESP32P4_LP_I2C_COUNT
#define ESP32_I2S_COUNT                         ESP32P4_I2S_COUNT
#define ESP32_TWAI_COUNT                        ESP32P4_TWAI_COUNT
#define ESP32_RMT_COUNT                         ESP32P4_RMT_COUNT
#define ESP32_LEDC_COUNT                        ESP32P4_LEDC_COUNT
#define ESP32_PCNT_COUNT                        ESP32P4_PCNT_COUNT
#define ESP32_ETM_COUNT                         ESP32P4_ETM_COUNT
#define ESP32_MCPWM_COUNT                       ESP32P4_MCPWM_COUNT
#define ESP32_PARL_IO_COUNT                     ESP32P4_PARL_IO_COUNT
#define ESP32_TIMER_GROUP_COUNT                 ESP32P4_TIMER_GROUP_COUNT
#define ESP32_TIMER_PER_GROUP_COUNT             ESP32P4_TIMER_PER_GROUP_COUNT
#define ESP32_TIMER_COUNT                       ESP32P4_TIMER_COUNT
#define ESP32_SYSTIMER_COUNT                    ESP32P4_SYSTIMER_COUNT
#define ESP32_SYSTIMER_COUNTER_COUNT            ESP32P4_SYSTIMER_COUNTER_COUNT
#define ESP32_SYSTIMER_ALARM_COUNT              ESP32P4_SYSTIMER_ALARM_COUNT
#define ESP32_GDMA_COUNT                        ESP32P4_GDMA_COUNT
#define ESP32_GDMA_PAIR_COUNT                   ESP32P4_GDMA_PAIR_COUNT
#define ESP32_GDMA_TX_CHANNEL_COUNT             ESP32P4_GDMA_TX_CHANNEL_COUNT
#define ESP32_GDMA_RX_CHANNEL_COUNT             ESP32P4_GDMA_RX_CHANNEL_COUNT
#define ESP32_GPIO_PORT_COUNT                   ESP32P4_GPIO_PORT_COUNT
#define ESP32_GPIO_PIN_COUNT                    ESP32P4_GPIO_PIN_COUNT
#define ESP32_GPIO_PIN_MAX                      ESP32P4_GPIO_PIN_MAX
#define ESP32_GPIO_PIN_REG_COUNT                ESP32P4_GPIO_PIN_REG_COUNT
#define ESP32_GPIO_FUNC_IN_COUNT                ESP32P4_GPIO_FUNC_IN_COUNT
#define ESP32_GPIO_FUNC_OUT_COUNT               ESP32P4_GPIO_FUNC_OUT_COUNT
#define ESP32_GPIO_FUNC_OUT_REG_COUNT           ESP32P4_GPIO_FUNC_OUT_REG_COUNT
#define ESP32_ADC_COUNT                         ESP32P4_ADC_COUNT
#define ESP32_ADC_DIGI_CONTROLLER_COUNT         ESP32P4_ADC_DIGI_CONTROLLER_COUNT
#define ESP32_UHCI_COUNT                        ESP32P4_UHCI_COUNT
#define ESP32_USB_SERIAL_JTAG_COUNT             ESP32P4_USB_SERIAL_JTAG_COUNT
#define ESP32_USB_OTG_COUNT                     ESP32P4_USB_OTG_COUNT
#define ESP32_AES_COUNT                         ESP32P4_AES_COUNT
#define ESP32_SHA_COUNT                         ESP32P4_SHA_COUNT
#define ESP32_HMAC_COUNT                        ESP32P4_HMAC_COUNT
#define ESP32_ECC_COUNT                         ESP32P4_ECC_COUNT
#define ESP32_ECDSA_COUNT                       ESP32P4_ECDSA_COUNT
#define ESP32_KEYMNG_COUNT                      ESP32P4_KEYMNG_COUNT
#define ESP32_EFUSE_COUNT                       ESP32P4_EFUSE_COUNT
#define ESP32_INTMTX_COUNT                      ESP32P4_INTMTX_COUNT
#define ESP32_INTPRI_COUNT                      ESP32P4_INTPRI_COUNT

#endif // __ESP32P4_H__
